{"id":1310,"date":"2020-06-16T12:48:05","date_gmt":"2020-06-16T12:48:05","guid":{"rendered":"http:\/\/sites.iitgn.ac.in\/cds\/wpcds\/?page_id=1310"},"modified":"2020-06-16T12:49:40","modified_gmt":"2020-06-16T12:49:40","slug":"why-to-recruit","status":"publish","type":"page","link":"https:\/\/cds.iitgn.ac.in\/why-to-recruit\/","title":{"rendered":"Why to recruit ?"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;3.25.3&#8243;][et_pb_row _builder_version=&#8221;3.25.3&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;3.25.3&#8243;][et_pb_text _builder_version=&#8221;3.25.3&#8243;]<\/p>\n<h1><strong>Why Recruit ?<\/strong><\/h1>\n<p>&nbsp;<\/p>\n<p><strong>GLOBALIZATION<\/strong>: 40% OF UG STUDENTS receive study abroad opportunities in the form of semester overseas, research internships, summer programs, etc., which is three times the average at U.S. universities. 80% OF FACULTY has overseas degree or postdoc experience. 15% OF FACULTY are visiting faculty from India and abroad.<\/p>\n<p><strong>FOUNDATION PROGRAMME<\/strong>: Transformative 5-week immersion program for incoming first-year students focused on creativity, leadership &amp; communication, ethics, social awareness, and physical fitness. The program has been widely lauded and increasingly emulated.<\/p>\n<p><strong>PROJECT ORIENTED LEARNING<\/strong>: Emphasis on learning by doing; 20% coursework in the humanities; core requirements in the life sciences, design and innovation.<\/p>\n<p><strong>CHOICE AND FLEXIBILITY<\/strong>: Options of dual majors, minors, honors; program and course flexibility and range, short courses. Co-curricular opportunities, such as Tinkerer Lab, Makers Space, projects, Innovation and Entrepreneurship Centre, etc.<\/p>\n<p><strong>DIVERSITY<\/strong>: 90% OF GRADUATE STUDENTS from out of state, representing 28 states\/union terrritories and 5 countries. 85% of undergraduate students from out of state from 26 states and union territories. 34% OF STUDENTS FEMALE 34% of graduate students and 20% of faculty female. 15% OF FACULTY visiting faculty from all over India and abroad. 95% of all faculty from out of state; average distance 1424 kms. 6% of regular and contractual faculty international.<\/p>\n<p><strong>INTERDISCIPLINARITY<\/strong>: 10% OF FACULTY with multi-discipline appointments. 14% OF PhD ADVISORS from outside discipline. 13% OF PUBLICATIONS with interdisciplinary authors. 21% of projects with Principal Investigator\/Co-PI from multiple disciplines.<\/p>\n<p><strong>STUDENT EMPOWERMENT<\/strong>: IITGN empowers students to pursue their passion with the most liberal branch change policies, flexibility in thecurriculum, leadership, self-governance and exciting extracurricular opportunities.<\/p>\n<p><strong>SELF-GOVERNANCE<\/strong>: Participatory student governance structures in all aspects of Institute affairs, including academic and student life and discipline.<\/p>\n<p><strong>EXPLORER FELLOWSHIP<\/strong>: Six week summer fellowship for students to discover India’s cultural diversity by visiting minimum six states (atleast one each in North, South and Northeast), on a shoestring budget of Rs 900\/day for travel, accommodation, food, and other living expenses.<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Why Recruit ? &nbsp; GLOBALIZATION: 40% OF UG STUDENTS receive study abroad opportunities in the form of semester overseas, research internships, summer programs, etc., which is three times the average at U.S. universities. 80% OF FACULTY has overseas degree or postdoc experience. 15% OF FACULTY are visiting faculty from India and abroad. FOUNDATION PROGRAMME: Transformative [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":""},"_links":{"self":[{"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/pages\/1310"}],"collection":[{"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/comments?post=1310"}],"version-history":[{"count":4,"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/pages\/1310\/revisions"}],"predecessor-version":[{"id":1317,"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/pages\/1310\/revisions\/1317"}],"wp:attachment":[{"href":"https:\/\/cds.iitgn.ac.in\/wp-json\/wp\/v2\/media?parent=1310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}